Ran Plan for project: `test` dir: `shared/us-east-1/base-tf-backend` workspace: `default`

<details><summary>Show Output</summary>

```diff
[02:49:00.899] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[02:49:00.907] INFO     ✔ OK                                                    
                                                                                
module.terraform_backend.data.aws_region.current: Reading...
module.terraform_backend.aws_iam_role.bucket_replication[0]: Refreshing state... [id=bb-shared-terraform-backend-bucket-replication-module]
module.terraform_backend.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.terraform_backend.aws_dynamodb_table.without_server_side_encryption[0]: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_s3_bucket.replication_bucket[0]: Refreshing state... [id=bb-shared-terraform-backend-replica]
module.terraform_backend.aws_s3_bucket_versioning.replication_bucket[0]: Refreshing state... [id=bb-shared-terraform-backend-replica]
module.terraform_backend.aws_s3_bucket_public_access_block.replication_bucket[0]: Refreshing state... [id=bb-shared-terraform-backend-replica]
module.terraform_backend.aws_s3_bucket.default: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_s3_bucket_public_access_block.default: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_s3_bucket_versioning.default: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_s3_bucket_server_side_encryption_configuration.replication_bucket[0]: Refreshing state... [id=bb-shared-terraform-backend-replica]
module.terraform_backend.time_sleep.wait_30_secs: Refreshing state... [id=2022-08-05T20:11:48Z]
module.terraform_backend.aws_s3_bucket_policy.default[0]: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_iam_policy.bucket_replication[0]: Refreshing state... [id=arn:aws:iam::763606934258:policy/bb-shared-terraform-backend-bucket-replication-module]
module.terraform_backend.aws_s3_bucket_policy.bucket_replication[0]: Refreshing state... [id=bb-shared-terraform-backend-replica]
module.terraform_backend.aws_s3_bucket_replication_configuration.this[0]: Refreshing state... [id=bb-shared-terraform-backend]
module.terraform_backend.aws_iam_policy_attachment.bucket_replication[0]: Refreshing state... [id=bb-shared-terraform-backend-role-policy-attachment]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.terraform_backend.data.aws_iam_policy_document.bucket_replication[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket_replication" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetReplicationConfiguration",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::bb-shared-terraform-backend",
            ]
          + sid       = "1"
        }
      + statement {
          + actions   = [
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionAcl",
              + "s3:GetObjectVersionForReplication",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::bb-shared-terraform-backend/*",
            ]
          + sid       = "2"
        }
      + statement {
          + actions   = [
              + "s3:ReplicateDelete",
              + "s3:ReplicateObject",
              + "s3:ReplicateTags",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::bb-shared-terraform-backend-replica/*",
            ]
          + sid       = "6"
        }
    }

  # module.terraform_backend.data.aws_iam_policy_document.default-ssl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "default-ssl" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::bb-shared-terraform-backend/*",
            ]
          + sid       = "EnforceSSlRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.terraform_backend.data.aws_iam_policy_document.default-ssl-vpc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "default-ssl-vpc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::bb-shared-terraform-backend/*",
            ]
          + sid       = "EnforceSSlRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::bb-shared-terraform-backend",
              + "arn:aws:s3:::bb-shared-terraform-backend/*",
            ]
          + sid       = "EnforceVPCRequestsOnly"

          + condition {
              + test     = "StringNotEquals"
              + values   = []
              + variable = "aws:sourceVpc"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.terraform_backend.aws_dynamodb_table.without_server_side_encryption[0] will be updated in-place
  ~ resource "aws_dynamodb_table" "without_server_side_encryption" {
        id                          = "bb-shared-terraform-backend"
        name                        = "bb-shared-terraform-backend"
      ~ tags                        = {
            "Environment" = "shared"
            "Layer"       = "base-tf-backend"
          + "Project"     = "leverage"
            "Terraform"   = "true"
        }
      ~ tags_all                    = {
          + "Project"     = "leverage"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.terraform_backend.aws_iam_policy.bucket_replication[0] will be updated in-place
  ~ resource "aws_iam_policy" "bucket_replication" {
        id               = "arn:aws:iam::763606934258:policy/bb-shared-terraform-backend-bucket-replication-module"
        name             = "bb-shared-terraform-backend-bucket-replication-module"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetReplicationConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::bb-shared-terraform-backend"
                      - Sid      = "1"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObjectVersionForReplication",
                          - "s3:GetObjectVersionAcl",
                          - "s3:GetObjectVersion",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::bb-shared-terraform-backend/*"
                      - Sid      = "2"
                    },
                  - {
                      - Action   = [
                          - "s3:ReplicateTags",
                          - "s3:ReplicateObject",
                          - "s3:ReplicateDelete",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::bb-shared-terraform-backend-replica/*"
                      - Sid      = "6"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.terraform_backend.aws_s3_bucket.default will be updated in-place
  ~ resource "aws_s3_bucket" "default" {
        id                          = "bb-shared-terraform-backend"
      ~ tags                        = {
            "Environment" = "shared"
            "Layer"       = "base-tf-backend"
          + "Project"     = "leverage"
            "Terraform"   = "true"
        }
      ~ tags_all                    = {
          + "Project"     = "leverage"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.terraform_backend.aws_s3_bucket.replication_bucket[0] will be updated in-place
  ~ resource "aws_s3_bucket" "replication_bucket" {
        id                          = "bb-shared-terraform-backend-replica"
      ~ tags                        = {
            "Environment" = "shared"
            "Layer"       = "base-tf-backend"
          + "Project"     = "leverage"
            "Terraform"   = "true"
        }
      ~ tags_all                    = {
          + "Project"     = "leverage"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.terraform_backend.aws_s3_bucket_policy.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "bb-shared-terraform-backend"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::bb-shared-terraform-backend/*"
                      - Sid       = "EnforceSSlRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.terraform_backend.aws_s3_bucket_replication_configuration.this[0],
│   on .terraform/modules/terraform_backend/bucket_replication.tf line 36, in resource "aws_s3_bucket_replication_configuration" "this":
│   36:     prefix = ""
│ 
│ prefix is deprecated. Use filter instead.
╵
╷
│ Warning: Invalid Attribute Combination
│ 
│   with module.terraform_backend.aws_s3_bucket_lifecycle_configuration.replication_bucket,
│   on .terraform/modules/terraform_backend/bucket_replication.tf line 86, in resource "aws_s3_bucket_lifecycle_configuration" "replication_bucket":
│   86: resource "aws_s3_bucket_lifecycle_configuration" "replication_bucket" {
│ 
│ No attribute specified when one (and only one) of [rule[0].filter,rule[0].prefix] is required
│ 
│ This will be an error in a future version of the provider
│ 
│ (and 3 more similar warnings elsewhere)
╵



Saved the plan to: test-default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "test-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fshared%252Fus-east-1%252Fbase-tf-backend%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p test
  ```
Plan: 0 to add, 5 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```